In [1]:
import pandas as pd

# Merging DataFrames

In [2]:
var1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
var2 = pd.DataFrame({"A": [1,2,5], "C": [10, 11, 12]}) #atleast 2 dataframes with same columns

In [3]:
merged_df = pd.merge(var1,var2,on ="A") #merging dataframes on column A
merged_df #jo common data hoga uska hi df banega

   A  B   C
0  1  4  10
1  2  5  11

In [9]:
m2df = pd.merge(var1,var2,how ="right") #right join will take all values from right dataframe and matching values from left dataframe
m2df

   A    B   C
0  1  4.0  10
1  2  5.0  11
2  5  NaN  12

In [7]:
m3df = pd.merge(var1,var2,how ="outer") #outer join will take all values from both dataframes and fill NaN for missing values
m3df

   A    B     C
0  1  4.0  10.0
1  2  5.0  11.0
2  3  6.0   NaN
3  5  NaN  12.0

In [10]:
var3 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
var4 = pd.DataFrame({"A": [1,2,5], "B": [10, 11, 12]})

In [14]:
m4df = pd.merge(var3,var4,left_index=True,right_index=True, suffixes=("name","id")) #inner join on multiple columns
m4df

   Aname  Bname  Aid  Bid
0      1      4    1   10
1      2      5    2   11
2      3      6    5   12

# Concat

In [15]:
var5 = pd.Series([1,2,3,4])
var6 = pd.Series([5,6,7,8])

In [18]:
c1sr = pd.concat([var5,var6],axis=0) #concatinating series 
c1sr

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
dtype: int64

In [26]:
d1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12,13,14]})
d2 = pd.DataFrame({"A": [5,6], "": [7,8]})

In [29]:
c2df = pd.concat([d1,d2],axis=1,join="outer") #concatinating dataframes -- inner, outer, left, right
c2df

   A   B    A
0  1  11  5.0  7.0
1  2  12  6.0  8.0
2  3  13  NaN  NaN
3  4  14  NaN  NaN

# Groupby

In [46]:
var = pd.DataFrame({"section": ["A", "B", "C", "A", "B", "C", "A", "B", "C"],
                    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah", "Ian"],
                    "s1": [85, 90, 78, 92, 88, 76, 95, 89, 84],
                    "s2": [80, 85, 82, 88, 90, 79, 91, 87, 83]}) 
var

  section     name  s1  s2
0       A    Alice  85  80
1       B      Bob  90  85
2       C  Charlie  78  82
3       A    David  92  88
4       B      Eva  88  90
5       C    Frank  76  79
6       A    Grace  95  91
7       B   Hannah  89  87
8       C      Ian  84  83

In [47]:
grouped = var.groupby("section") #groupby department and calculate mean salary
grouped

In [48]:
for section, group in grouped:
    print(f"Group Name: {section}")
    print(group,"\n")

Group Name: A
  section   name  s1  s2
0       A  Alice  85  80
3       A  David  92  88
6       A  Grace  95  91

Group Name: B
  section    name  s1  s2
1       B     Bob  90  85
4       B     Eva  88  90
7       B  Hannah  89  87

Group Name: C
  section     name  s1  s2
2       C  Charlie  78  82
5       C    Frank  76  79
8       C      Ian  84  83

In [49]:
grouped.get_group("A")

  section   name  s1  s2
0       A  Alice  85  80
3       A  David  92  88
6       A  Grace  95  91